## Вопрос 2

#### В настоящий момент, особенно на западе, есть тренд и спрос на адаптацию контента для людей с ограниченными возможностями. Предложите облачные сервисы, которые могли бы помочь быстро адаптировать ваше приложение.

Рассмотрим какие облачные сервисы можно реализовать на примерах:
1. В этом мире существуют люди с аутизмом или проще говоря с нарушением умственных способностей. Мы можем использовать Yandex GPT API, которая будет анализировать большие тексты и выдавать краткую выжимку для упрощенного понимания информации этими людьми. Либо  более конкретную модель у гугла Google Cloud Natural Language API
2. Для людей с плохим зрением мы можем предложить симбиоз трех сервисов: Amazon Rekognition, Amazon Textract и Amazon Lex один будет определять что находится на картинке, второй переводить это в текст, а третий озвучивать.
3. Существуют люди с дислексией, для них мы внедрим Yandex.SpellChecker и решим их проблему.
